In [5]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [6]:
ser= pd.Series()
ser

Series([], dtype: float64)

In [3]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
# Notice Datatype
ser = pd.Series([20,15.7,'10'])
ser

0      20
1    15.7
2      10
dtype: object

In [7]:
#Create Dictionary
dict = {'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [8]:
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [9]:
#Add new column and add values into it
df['States']= "CA NV AZ".split()

In [10]:
df

   A  B  C States
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [11]:
# how to create NaN values and its manipulation
dict = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [12]:
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df['D'] = [20,30,40]
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [15]:
print("\n Dropping any column with a NaN value\n",'-'*35, sep='')
print(df.dropna(axis=1))

 Dropping any column with a NaN value
-----------------------------------
   C   D
0  1  20
1  2  30
2  3  40

In [16]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [22]:
print("\n Dropping any Row with a NaN value\n",'-'*35, sep='')
print(df.dropna(axis=0))

 Dropping any Row with a NaN value
-----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [18]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [23]:
print("\n Filling NaN value\n",'-'*35, sep='')
print(df.fillna(value=50))

 Filling NaN value
-----------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  3  40

In [21]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [25]:
print("\nFilling values with a computed value (mean of column a Here)\n",'-'*60,sep='')
df.fillna(value=df['C'].mean(),inplace=True)
print(df)

Filling values with a computed value (mean of column a Here)
------------------------------------------------------------
     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [26]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [27]:
#Create DataFrame
dict = {'Company':['GooG','GooG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Ravi','Raj','Yogi','Rashi','Pinky'],
       'Salary':[25000,35000,15000,24000,15000,35000]}
df = pd.DataFrame(dict)
df

  Company Person  Salary
0    GooG    Sam   25000
1    GooG   Ravi   35000
2    MSFT    Raj   15000
3    MSFT   Yogi   24000
4      FB  Rashi   15000
5      FB  Pinky   35000

In [28]:
byComp = df.groupby('Company')
print(byComp.mean())

          Salary
Company
FB       25000.0
GooG     30000.0
MSFT     19500.0

In [29]:
print(byComp.sum())

         Salary
Company
FB        50000
GooG      60000
MSFT      39000

In [30]:
#ConCatinating DataFrame
Class_a = pd.DataFrame({'Mat':[45,65,35,25],
                       'Eng':[65,85,45,35],
                       'Sci':[75,85,95,45],
                       'Chem':[5,45,25,55]},
                      index=['Ravi','Shyam','Shankar','Shurbhi'])
Class_a

         Mat  Eng  Sci  Chem
Ravi      45   65   75     5
Shyam     65   85   85    45
Shankar   35   45   95    25
Shurbhi   25   35   45    55

In [31]:
Class_b = pd.DataFrame({'Mat':[45,65,35,25],
                       'Eng':[65,85,45,35],
                       'Sci':[75,85,95,45],
                       'Chem':[5,45,25,55]},
                      index=['Yogi','Yash','Yushuf','Yashika'])
Class_b

         Mat  Eng  Sci  Chem
Yogi      45   65   75     5
Yash      65   85   85    45
Yushuf    35   45   95    25
Yashika   25   35   45    55

In [32]:
Class_c = pd.DataFrame({'Mat':[55,60,35,65],
                       'Eng':[65,85,45,35],
                       'Sci':[75,85,95,45],
                       'Chem':[5,45,25,55]},
                      index=['Pinky','Priya','Pihu','Pooja'])
Class_c

       Mat  Eng  Sci  Chem
Pinky   45   65   75     5
Priya   65   85   85    45
Pihu    35   45   95    25
Pooja   25   35   45    55

In [33]:
#Continate
All_student_marks = pd.concat([Class_a,Class_b,Class_c],axis=0)
print(All_student_marks)

         Mat  Eng  Sci  Chem
Ravi      45   65   75     5
Shyam     65   85   85    45
Shankar   35   45   95    25
Shurbhi   25   35   45    55
Yogi      45   65   75     5
Yash      65   85   85    45
Yushuf    35   45   95    25
Yashika   25   35   45    55
Pinky     45   65   75     5
Priya     65   85   85    45
Pihu      35   45   95    25
Pooja     25   35   45    55

In [1]:
import numpy as np
import pandas as pd

In [4]:
#define Function
def salary_hike(x):
    if(x>3000):
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x*1.5)

In [5]:
dict = {'Dept':[1,2,3,4,5,6,7,8,9,10],
       'Emp_Name':['Sam','Ravi','Raj','Yogi','Rashi','Pinky','savi','kunal','kapil','yash'],
       'Salary':[5000,300,1000,4000,3500,3500,5500,2000,5000,6000]}
df = pd.DataFrame(dict)
df

   Dept Emp_Name  Salary
0     1      Sam    5000
1     2     Ravi     300
2     3      Raj    1000
3     4     Yogi    4000
4     5    Rashi    3500
5     6    Pinky    3500
6     7     savi    5500
7     8    kunal    2000
8     9    kapil    5000
9    10     yash    6000

In [6]:
df['New_Salary'] = df['Salary'].apply(salary_hike)
print(df)

   Dept Emp_Name  Salary  New_Salary
0     1      Sam    5000      6500.0
1     2     Ravi     300       450.0
2     3      Raj    1000      1500.0
3     4     Yogi    4000      5200.0
4     5    Rashi    3500      4550.0
5     6    Pinky    3500      4550.0
6     7     savi    5500      7150.0
7     8    kunal    2000      3000.0
8     9    kapil    5000      6500.0
9    10     yash    6000      7800.0

In [7]:
df['New_Length']= df['Emp_Name'].apply(len)
print(df)

   Dept Emp_Name  Salary  New_Salary  New_Length
0     1      Sam    5000      6500.0           3
1     2     Ravi     300       450.0           4
2     3      Raj    1000      1500.0           3
3     4     Yogi    4000      5200.0           4
4     5    Rashi    3500      4550.0           5
5     6    Pinky    3500      4550.0           5
6     7     savi    5500      7150.0           4
7     8    kunal    2000      3000.0           5
8     9    kapil    5000      6500.0           5
9    10     yash    6000      7800.0           4

In [8]:
df['New_Salary'].apply(lambda x:np.sqrt(x))

0    80.622577
1    21.213203
2    38.729833
3    72.111026
4    67.453688
5    67.453688
6    84.557673
7    54.772256
8    80.622577
9    88.317609
Name: New_Salary, dtype: float64

In [10]:
print("\nSum of the column is: ",df['New_Salary'].sum())

Sum of the column is:  47200.0

In [13]:
print("\nMin amd Max Salary is: ",df['New_Salary'].min(), "and", df['New_Salary'].max())

Min amd Max Salary is:  450.0 and 7800.0

In [14]:
print("\n Name of Columns\n",'-'*20, sep='')
print(df.columns)

 Name of Columns
--------------------
Index(['Dept', 'Emp_Name', 'Salary', 'New_Salary', 'New_Length'], dtype='object')

In [17]:
l = list(df.columns)
print(l)

['Dept', 'Emp_Name', 'Salary', 'New_Salary', 'New_Length']

In [18]:
del df['Salary']
print(df)

   Dept Emp_Name  New_Salary  New_Length
0     1      Sam      6500.0           3
1     2     Ravi       450.0           4
2     3      Raj      1500.0           3
3     4     Yogi      5200.0           4
4     5    Rashi      4550.0           5
5     6    Pinky      4550.0           5
6     7     savi      7150.0           4
7     8    kunal      3000.0           5
8     9    kapil      6500.0           5
9    10     yash      7800.0           4

In [19]:
df.sort_values(by='New_Salary')

   Dept Emp_Name  New_Salary  New_Length
1     2     Ravi       450.0           4
2     3      Raj      1500.0           3
7     8    kunal      3000.0           5
4     5    Rashi      4550.0           5
5     6    Pinky      4550.0           5
3     4     Yogi      5200.0           4
0     1      Sam      6500.0           3
8     9    kapil      6500.0           5
6     7     savi      7150.0           4
9    10     yash      7800.0           4

In [20]:
df.sort_values(by='New_Salary', ascending=False)

   Dept Emp_Name  New_Salary  New_Length
9    10     yash      7800.0           4
6     7     savi      7150.0           4
0     1      Sam      6500.0           3
8     9    kapil      6500.0           5
3     4     Yogi      5200.0           4
4     5    Rashi      4550.0           5
5     6    Pinky      4550.0           5
7     8    kunal      3000.0           5
2     3      Raj      1500.0           3
1     2     Ravi       450.0           4

In [21]:
dict = {'Dept':[1,2,3,4,5,6,7,8,9,10],
       'Emp_Name':['Sam','Ravi','Raj',np.NaN,'Rashi','Pinky','savi',np.NaN,'kapil','yash'],
       'Salary':[5000,300,1000,4000,3500,3500,5500,2000,5000,np.NaN]}
df = pd.DataFrame(dict)
df

   Dept Emp_Name  Salary
0     1      Sam  5000.0
1     2     Ravi   300.0
2     3      Raj  1000.0
3     4      NaN  4000.0
4     5    Rashi  3500.0
5     6    Pinky  3500.0
6     7     savi  5500.0
7     8      NaN  2000.0
8     9    kapil  5000.0
9    10     yash     NaN

In [23]:
df.isnull().sum()

Dept        0
Emp_Name    2
Salary      1
dtype: int64

In [24]:
import pandas as pd

In [25]:
#load .csv file
ipl = pd.read_csv('https://github.com/training-ml/Files/blob/main/matches.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 25, saw 353